[
    {
        "name": "Rocket Goal",
        "url": "<iframe id="game-iframe" src="https://rocketgoal.io/?sdk=crazy" allow=" accelerometer; gyroscope; autoplay; payment; fullscreen; microphone; clipboard-read; clipboard-write 'self' https://rocketgoal.io/?sdk=crazy" webkitallowfullscreen="true" mozallowfullscreen="true" msallowfullscreen="true" allowfullscreen="true" data-testid="inner-iframe" sandbox="allow-forms allow-modals allow-orientation-lock allow-pointer-lock allow-popups allow-presentation allow-scripts allow-same-origin allow-downloads allow-popups-to-escape-sandbox" style="border: 0px; outline: 0px; background-color: rgb(255, 255, 255); width: 10px; height: 10px; min-width: 100%; min-height: 100%;"></iframe>"
    },
    {
        "name": "Bloxd",
        "url": "<iframe id="game-iframe" src="https://games.crazygames.com/en_US/bloxdhop-io/index.html?v=1.351" title="Bloxd.io" scrolling="no" allow="autoplay; payment; fullscreen; microphone; focus-without-user-activation *; screen-wake-lock; gamepad; clipboard-read; clipboard-write; accelerometer; gyroscope; " allowfullscreen="" sandbox="allow-forms allow-modals allow-orientation-lock allow-pointer-lock allow-presentation allow-scripts allow-same-origin allow-downloads  allow-popups allow-popups-to-escape-sandbox" loading="eager" importance="high" data-hj-allow-iframe="true" style="border: 0px; margin: 0px; padding: 0px; width: 100%; height: 100%; position: absolute; top: 0px; left: 0px; user-select: none;"><p>Bloxd.io is an IO adventure game with Minecraft-style visuals and multiple game modes, including parkour challenges, creative sandbox building, and combat-based gameplay. <h2>How to Play Bloxd.io</h2><p>Bloxd.io is a sandbox game in which you navigate challenging obstacle courses by timing your jumps and movements accurately. In survival mode, you gather resources, craft tools, and fend off enemies to stay alive. There are several game modes to choose from to start the game, each with a variety of challenges.</p><h3>Bloxd.io Game Modes</h3><p>Choose from one of the many game modes to begin your Bloxd.io journey.</p><h4>BloxdHop.io</h4><p>In the BloxdHop game mode, your mission is to reach the end of the map within the given timeframe. To reach the end, you must hop through the level parkour-style onto blocks of various sizes.</p><h4>DoodleCube</h4><p>This game mode is similar to drawing games like Gartic.io. Players create objects based on the theme presented, and other users vote on how representative they are of that object.</p><h4>EvilTower</h4><p>The mission is to reach the top of the Evil Tower! Similar to BloxdHop, you use your parkour skills to reach the end. EvilTower is inspired by the Tower of Hell from a famous online platform.</p><h4>Peaceful</h4><p>Peaceful mode is like creative mode in Minecraft. You can roam freely, collecting resources and building here.</p><h4>CubeWarfare</h4><p>This game mode adds exciting battles. Compete against other players in a third-person shooter setting where you can also build blocks.</p><h4>Full list of game modes.</h4><p>Bloxd.io is regularly updated with fun new features and modes. Here is a selection of current game modes.</p><ul><li><span contenteditable="false"></span>BloxdHop.io</li><li><span contenteditable="false"></span>DoodleCube</li><li><span contenteditable="false"></span>EvilTower</li><li><span contenteditable="false"></span>Peaceful</li><li><span contenteditable="false"></span>CubeWarfare</li><li><span contenteditable="false"></span>Survival</li><li><span contenteditable="false"></span>Peaceful</li><li><span contenteditable="false"></span>Creative</li><li><span contenteditable="false"></span>Bedwars</li><li><span contenteditable="false"></span>Sky Wars</li><li><span contenteditable="false"></span>OneBlock</li><li><span contenteditable="false"></span>Greenville</li><li><span contenteditable="false"></span>Hide and Seek</li><li><span contenteditable="false"></span>Murder Mystery</li><li><span contenteditable="false"></span>Plots</li><li><span contenteditable="false"></span>Pirates</li><li><span contenteditable="false"></span>Survival Royale</li><li><span contenteditable="false"></span>Worlds</li></ul><h3>More Games Like This</h3><p>Although Bloxd.io is a unique game that provides endless entertainment, there are similar titles to check out when you're finished playing. Other<a href="https://www.crazygames.com/c/io" target="_blank"> IO games</a> like this include <a href="https://www.crazygames.com/game/veck-io" target="_blank">Veck io</a> and <a href="https://www.crazygames.com/game/kour-io" target="_blank">Kour io</a>.</p><h3>Features</h3><ul><li><span contenteditable="false"></span>Explore fun, voxelated worlds for free in your web browser.</li><li><span contenteditable="false"></span>Play various game modes with different objectives.</li><li><span contenteditable="false"></span>Earn gold from your achievements and spend it in the store.</li><li><span contenteditable="false"></span>Join your friends in multiplayer games.</li></ul><h3>Release Date</h3><p>February 2021</p><h3>Developer</h3><p>Arthur made BloxdHop.io.</p><h3>Platform</h3><p>Web browser (desktop and mobile)</p></iframe>"
    },
    {
        "name": "Geometry Game",
        "url": "<iframe id="game-iframe" src="https://games.crazygames.com/en_US/geometry-dash-online/index.html?v=1.351" title="Geometry Game" scrolling="no" allow="autoplay; payment; fullscreen; microphone; focus-without-user-activation *; screen-wake-lock; gamepad; clipboard-read; clipboard-write; accelerometer; gyroscope; " allowfullscreen="" sandbox="allow-forms allow-modals allow-orientation-lock allow-pointer-lock allow-presentation allow-scripts allow-same-origin allow-downloads  allow-popups allow-popups-to-escape-sandbox" loading="eager" importance="high" data-hj-allow-iframe="true" style="border: 0px; margin: 0px; padding: 0px; width: 100%; height: 100%; position: absolute; top: 0px; left: 0px; user-select: none;"><p>Geometry Game is a free side-scrolling <a target="_blank" href="https://www.crazygames.com/t/platform">platformer</a> played in sync with <a target="_blank" href="https://www.crazygames.com/t/music">musical rhythms</a>. Groove your way over and under obstacles to keep the musical momentum alive. If you slip up, it’s back to the beginning! Inspired by the original Geometry Dash, this is a Scratch version, bringing the classic rhythm-based gameplay to your browser. <p><em>&quot;This game became our family obsession during lockdown, but we have recently returned to play it. Combining simple controls and a high level of challenge makes for a fun experience we can all enjoy. Because the play is in time with the music, it’s also a good way to develop children’s sense of timing and musicality. Sometimes we’ve even played it once the kids are in bed, to see if we can improve our skills for the next family session.&quot;</em></p><p>Review by <a target="_blank" href="https://www.familygamingdatabase.com/game/Geometry+Dash">FamilyGamingDatabase</a>.</p><h2>How to Play Geometry Game</h2><p>Geometry Dash is a 2D <a target="_blank" href="https://www.crazygames.com/t/platform">platformer</a> game where you are in charge of moving a shape through a bunch of obstacles, all to the beat of the music. The square actually moves by itself, and all you have to do is click to jump when necessary and use the up/down arrows to steer vehicles. The way you dodge obstacles is often in sync with the beat, so make sure your sound is on and enjoy the experience!</p><p>The key to the game is timing. The levels themselves scroll automatically, and hitting spikes, walls, or other hazards results in an instant crash and restart. If you fail, it&#39;s back to the beginning. The constant die-and-retry loop will have you quickly memorizing the patterns of each level and, more importantly, the precise timing of crucial jumps. This dynamic is what makes the game addictive.</p><h3>Listen to the beat</h3><p>Geometry Game is a music game, and many jumps and movements are synced to the beat of the background music, so paying attention to the rhythm is not really an option. Practice Mode lets you place checkpoints to learn tricky sections without starting over, so it&#39;s a good place to start or go back to if you&#39;re having trouble completing levels.</p><h3>Watch the obstacles</h3><p>Levels also feature unique objects like portals, pads, and orbs. Portals can flip gravity, change speed, or switch vehicle modes. Jump pads automatically launch you, and orbs trigger special actions mid-air. These elements replace traditional power-ups, creating dynamic challenges that keep each level pretty much unpredictable.</p><h3>Tips &amp; Tricks</h3><ul><li><strong>Practice Mode. </strong>Use Practice Mode to break a level into smaller sections. Place checkpoints at tricky spots and repeat until you can clear each segment consistently. This builds muscle memory and makes full runs much easier.</li><li><strong>Follow the Rhythm. </strong>The game’s music often cues obstacle timing. Pay attention to beats and sync your jumps to the song. You can try humming the beat to get the rhythm down.</li></ul><h3>Geometry Game Reviews</h3><p>The game has received positive reviews from critics. Softpedia praised the game&#39;s style, saying, &quot;While it can get a bit frustrating sometimes, you can always complete the stages using the practice mode and then jump into the many different user-generated levels.&quot;</p><h3>Geometry Game History</h3><p>Geometry Dash started without a clear vision, according to the developer RobTop. It could have moved in any direction. It started as a template with a cube that could crash and jump, and evolved into the smash-hit game it is today.</p><p>When the game was first launched, it was called Geometry Jump and only had seven levels. Later on, it was renamed &quot;Geometry Dash.&quot; Currently, there are four free versions of the game, one being &quot;Geometry Dash Lite,&quot; which now includes the first 13 levels from the full version.</p><h3>Features</h3><ul><li>Challenging levels that vary in difficulty from hard to almost impossible</li><li>Simple controls make the game intuitive to learn from the start</li><li>Excellent music that compels you to reach the next part of the track</li><li>Fun gameplay synced to the beat!</li></ul><h3>More Geometry Games</h3><p>If you like playing Geometry Dash for free in your web browser, check out <a target="_blank" href="https://www.crazygames.com/game/geometry-neon-dash-subzero">Geometry Dash Subzero.</a></p><h3>More Games Like This</h3><p>For more games played in time with musical rhythms, check out <a target="_blank" href="https://www.crazygames.com/game/friday-night-funkin">FNF</a>, a popular freestyle music game. If you want to have a bit of silly fun, <a target="_blank" href="https://www.crazygames.com/game/blob-opera">Blob Opera</a> will provide plenty of entertainment! Other music-centric games to try include Friday Night Funkin&#39;, where you rap battle it out with other musically inclined players. And for more <a target="_blank" href="https://www.crazygames.com/t/music">musical rhythm</a> games, <a target="_blank" href="https://www.crazygames.com/game/sprunki-itn">Sprunki</a> will hit the spot, as you&#39;ll get to create your own vibrant sounds and melodies.</p><h3><strong>Platforms</strong></h3><p>Geometry Dash is available across all platforms: web, Android, iOS, and Windows phones.</p><h3><strong>Developer</strong></h3><p>The game was created by RobTop Games for mobile, before being ported to PC as Geometry Game. This Scratch version is made by Griffpatch.</p></iframe>"
    }
]
